Misc/SOAP.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:kon="http://schemas.datacontract.org/2004/07/KonicaMinolta.SAP.Integration.Service"><soapenv:Header/><soapenv:Body><tem:doZaBAPI><tem:wsOrderNumber>000010912441</tem:wsOrderNumber><tem:wsBWClose>37895</tem:wsBWClose><tem:wsBWOpen>37893</tem:wsBWOpen><tem:wsColClose>4630</tem:wsColClose><tem:wsColOpen>4629</tem:wsColOpen><tem:wsLoginUser>GR15</tem:wsLoginUser><tem:wsCreatedDate>2013-10-21</tem:wsCreatedDate><tem:wsPDFDirectory>/PDFDirectory/000010912441.pdf</tem:wsPDFDirectory><tem:wsGoodsMvtItem><kon:GOODSMVT_ITEM><kon:ENTRY_QNT>1.00000000</kon:ENTRY_QNT><kon:MATERIAL>1391-1016-01</kon:MATERIAL><kon:PLANT>1065</kon:PLANT><kon:STGE_LOC>GR15</kon:STGE_LOC></kon:GOODSMVT_ITEM><kon:GOODSMVT_ITEM><kon:ENTRY_QNT>1.00000000</kon:ENTRY_QNT><kon:MATERIAL>13QA41040</kon:MATERIAL><kon:PLANT>1065</kon:PLANT><kon:STGE_LOC>GR15</kon:STGE_LOC></kon:GOODSMVT_ITEM><kon:GOODSMVT_ITEM><kon:ENTRY_QNT>1.00000000</kon:ENTRY_QNT><kon:MATERIAL>13QA41270</kon:MATERIAL><kon:PLANT>1065</kon:PLANT><kon:STGE_LOC>GR15</kon:STGE_LOC></kon:GOODSMVT_ITEM></tem:wsGoodsMvtItem><tem:wsTimeTickets><kon:TIMETICKETS><kon:ACT_WORK>20.00000000</kon:ACT_WORK><kon:ACT_WORK_2>0.0000000</kon:ACT_WORK_2><kon:CONF_TEXT></kon:CONF_TEXT><kon:EXEC_FIN_DATE>2013-10-21</kon:EXEC_FIN_DATE><kon:EXEC_FIN_TIME>12:10:02</kon:EXEC_FIN_TIME><kon:EXEC_START_DATE>2013-10-21</kon:EXEC_START_DATE><kon:EXEC_START_TIME>12:09:49</kon:EXEC_START_TIME><kon:EX_CREATED_BY>Mobile</kon:EX_CREATED_BY><kon:EX_CREATED_DATE>2013-10-21</kon:EX_CREATED_DATE><kon:EX_CREATED_TIME>12:11:21</kon:EX_CREATED_TIME><kon:FIN_CONF>X</kon:FIN_CONF><kon:OPERATION>0030</kon:OPERATION></kon:TIMETICKETS><kon:TIMETICKETS><kon:ACT_WORK>1.00000000</kon:ACT_WORK><kon:ACT_WORK_2>0.0000000</kon:ACT_WORK_2><kon:CONF_TEXT></kon:CONF_TEXT><kon:EXEC_FIN_DATE>2013-10-21</kon:EXEC_FIN_DATE><kon:EXEC_FIN_TIME>12:10:09</kon:EXEC_FIN_TIME><kon:EXEC_START_DATE>2013-10-21</kon:EXEC_START_DATE><kon:EXEC_START_TIME>12:10:02</kon:EXEC_START_TIME><kon:EX_CREATED_BY>Mobile</kon:EX_CREATED_BY><kon:EX_CREATED_DATE>2013-10-21</kon:EX_CREATED_DATE><kon:EX_CREATED_TIME>12:11:21</kon:EX_CREATED_TIME><kon:FIN_CONF>X</kon:FIN_CONF><kon:OPERATION>0010</kon:OPERATION></kon:TIMETICKETS><kon:TIMETICKETS><kon:ACT_WORK>1.00000000</kon:ACT_WORK><kon:ACT_WORK_2>0.0000000</kon:ACT_WORK_2><kon:CONF_TEXT></kon:CONF_TEXT><kon:EXEC_FIN_DATE>2013-10-21</kon:EXEC_FIN_DATE><kon:EXEC_FIN_TIME>12:10:02</kon:EXEC_FIN_TIME><kon:EXEC_START_DATE>2013-10-21</kon:EXEC_START_DATE><kon:EXEC_START_TIME>12:09:49</kon:EXEC_START_TIME><kon:EX_CREATED_BY>Mobile</kon:EX_CREATED_BY><kon:EX_CREATED_DATE>2013-10-21</kon:EX_CREATED_DATE><kon:EX_CREATED_TIME>12:11:21</kon:EX_CREATED_TIME><kon:FIN_CONF>X</kon:FIN_CONF><kon:OPERATION>0020</kon:OPERATION></kon:TIMETICKETS></tem:wsTimeTickets></tem:doZaBAPI></soapenv:Body></soapenv:Envelope>